
var page12_model=angular.module('MyApp.page12', []);

page12_model.controller('page12_LineCtrl',[
	'$scope',
	function ($scope){
		$scope.labels = ["0时", "1时", "2时", "3时", "4时", "5时", "6时","7时", "8时", "9时", "10时", "11时", "12时", "13时","14时", "15时", "16时", "17时", "18时", "19时", "20时","21时","22时","23时"];
		$scope.series = ['温度', '湿度'];
		/*如果不用json图表的另一种表达数据的方式
		$scope.data = [
			[65, 59, 80, 81, 56, 55, 40,65, 59, 80, 81, 56, 55, 40,65, 59, 80, 81, 56, 55, 40,22,23,24],
	    	[22, 59, 80, 33, 56, 55, 40,22, 59, 80, 81, 55, 55, 40,66, 59, 80, 81, 33, 55, 40,22,23,24],
	  	];
	  	*/
	  	//图表点击时动作
		$scope.onClick = function (points, evt) {
	    	console.log(points, evt);
		};


        var json = {
        	"series": ["SeriesA","se1"],
        	//也可以用上面的scope.data的形式
        	"data": [["65", "59", "80", "81", "56", "55", "40","65", "59", "80","81","56","55","40","65","59","80","81","56","55","40","22","23","24"],
        			["65", "59", "80", "81", "56", "55", "40","45", "66", "80","81","56","55","40","65","59","80","81","56","55","40","22","23","24"]],
        	"labels":["0时", "1时", "2时", "3时", "4时", "5时", "6时","7时", "8时", "9时", "10时", "11时", "12时", "13时","14时", "15时", "16时", "17时", "18时", "19时", "20时","21时","22时","23时"],
        	"colours": [{ // default
        		//填充颜色，有多个曲线时如果后面的没定义就随机
          		"fillColor": ["rgba(22, 211, 112, 1)"],
          		//图例颜色如seriesA：黄色
          		"strokeColor": "rgba(20,100,13,1)",
          		"pointColor": "rgba(220,220,220,1)",
          		"pointStrokeColor": "#fff",
          		"pointHighlightFill": "#fff",
          		"pointHighlightStroke": "rgba(151,187,205,0.8)"
        	}]
      	};
  		$scope.ocw = json;
	}
]);