
var page12_model=angular.module('MyApp.page12', []);

//24小时温度曲线的控制器，
page12_model.controller('page12_LineCtrl_wenduDay',[
	'$scope',
	function ($scope){
		/*如果不用json图表的另一种表达数据的方式
		$scope.data = [
			[65, 59, 80, 81, 56, 55, 40,65, 59, 80, 81, 56, 55, 40,65, 59, 80, 81, 56, 55, 40,22,23,24],
	    	[22, 59, 80, 33, 56, 55, 40,22, 59, 80, 81, 55, 55, 40,66, 59, 80, 81, 33, 55, 40,22,23,24],
	  	];
	  	*/
	  	//图表点击时动作
		$scope.onClick = function (points, evt) {
	    	console.log(points, evt);
		};


        var lineJson = {
        	"series": ["室内温度","室外温度"],
        	//也可以用上面的scope.data的形式
        	"data": [["18", "19", "20", "21", "21", "22", "21.4","22.4", "24.5", "22.7","23.8","25.7","22.4","26.7","22.9","24.5","19.5","26","21","23","22","22","30","15"],
        			["22.4","26.7","22.9","24.5","19.5","26","21","23","22","22","30","15","18", "19", "20", "21", "21", "22", "21.4","22.4", "24.5", "22.7","23.8","25.7"]],
        	"labels":["0时", "1时", "2时", "3时", "4时", "5时", "6时","7时", "8时", "9时", "10时", "11时", "12时", "13时","14时", "15时", "16时", "17时", "18时", "19时", "20时","21时","22时","23时"],
        	//"colours": [{ // default,可以在canvas里面通过colours="ocw.colours"-使用
        		//填充颜色，有多个曲线时如果后面的没定义就随机
          		//"fillColor": ["rgba(22, 211, 112, 1)"],
          		//图例颜色如seriesA：黄色
          		//"strokeColor": "rgba(20,100,13,1)",
          		//"pointColor": "rgba(220,220,220,1)",
          		//"pointStrokeColor": "#fff",
          		//"pointHighlightFill": "#fff",
          		//"pointHighlightStroke": "rgba(151,187,205,0.8)"
        	//}]
      	};
  		$scope.ocw = lineJson;
	}
]);


/*====================月平均，最大，最小温度=================================
  参数：
      1.$scope.ocw用于初始化显示图表的数据
      2.$scope.isRotate=false;//一开始刷新图标是不转的
  方法：
      1.reflashData更新温度月数据
=========================================================*/
page12_model.controller('page12_LineCtrl_wenduMonth',[
  '$scope',
  '$http',
  function ($scope,$http){
    $scope.isRotate=false;//一开始刷新图标是不转的
      //图表点击时动作
    $scope.onClick = function (points, evt) {
        console.log(points, evt);
    };
    //图表初始化显示的东西
    $scope.ocw = {
      "series": ["最高温度","平均温度","最低温度"],
      //也可以用上面的scope.data的形式
      "data": [["20", "20", "20", "20", "20", "20", "20","20", "20", "20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20"],
          ["19", "19", "19", "19", "19", "19", "19","19", "19", "19","19","19","19","19","19","19","19","19","19","19","19","19","19","19","19","19","19","19","19","19","19"],
          ["18", "18", "18", "18", "18", "18", "18","18", "18", "18","18","18","18","18","18","18","18","18","18","18","18","18","18","18","18","18","18","18","18","18","18"]],
      "labels":["1", "2", "3", "4", "5", "6","7", "8", "9", "10", "11", "12", "13","14", "15", 
           "16", "17", "18", "19", "20","21","22","23","24","25","26","27","28","29","30","31"],
      "colours": [{ // default
        //填充颜色，有多个曲线时如果后面的没定义就随机
          "fillColor": ["rgba(22, 211, 112, 0)","rgba(22, 211, 112, 0)"],
          //图例颜色如seriesA：黄色
          "strokeColor": "rgba(20,100,13,1)",
          "pointColor": "rgba(220,220,220,1)",
          "pointStrokeColor": "#fff",
          "pointHighlightFill": "#fff",
          "pointHighlightStroke": "rgba(151,187,205,0.8)"
      }]
    };

    //resetful更新数据,单击刷新按钮时
    $scope.reflashData=function(){
      $scope.isRotate=true;//刷新图标是转的
      //让数据先初始化加载后有个动画效果
      $scope.ocw.data[0]=["20", "20", "20", "20", "20", "20", "20","20", "20", "20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20"];
      $scope.ocw.data[1]=["20", "20", "20", "20", "20", "20", "20","20", "20", "20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20"];
      $scope.ocw.data[2]=["20", "20", "20", "20", "20", "20", "20","20", "20", "20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20"];

      $http.get('/resetful/nm820/GetTempHistory').success(function(data){
        console.log(data.Avgs);
        $scope.ocw.labels=data.Days;
        $scope.ocw.data[0]=data.Maxs;
        $scope.ocw.data[1]=data.Avgs;
        $scope.ocw.data[2]=data.Mins;
        console.log($scope.ocw);
        $scope.isRotate=false;//刷新图标是不转的
      });
    }
  }
]);

page12_model.controller('page12_LineCtrl_wenduMonth',[
	'$scope',
  '$http',
	function ($scope,$http){
    $scope.isRotate=false;//一开始刷新图标是不转的
	  	//图表点击时动作
		//$scope.onClick = function (points, evt) {
	  //  	console.log(points, evt);
		//};
    //图表初始化显示的东西
    $scope.ocw = {
    	"series": ["最高温度","平均温度","最低温度"],
    	//也可以用上面的scope.data的形式
    	"data": [["20", "20", "20", "20", "20", "20", "20","20", "20", "20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20"],
    			["19", "19", "19", "19", "19", "19", "19","19", "19", "19","19","19","19","19","19","19","19","19","19","19","19","19","19","19","19","19","19","19","19","19","19"],
    			["18", "18", "18", "18", "18", "18", "18","18", "18", "18","18","18","18","18","18","18","18","18","18","18","18","18","18","18","18","18","18","18","18","18","18"]],
    	"labels":["1", "2", "3", "4", "5", "6","7", "8", "9", "10", "11", "12", "13","14", "15", 
    			 "16", "17", "18", "19", "20","21","22","23","24","25","26","27","28","29","30","31"],
    	"colours": [{ // default
    		//填充颜色，有多个曲线时如果后面的没定义就随机
      		"fillColor": ["rgba(22, 211, 112, 0)","rgba(22, 211, 112, 0)"],
      		//图例颜色如seriesA：黄色
      		"strokeColor": "rgba(20,100,13,1)",
      		"pointColor": "rgba(220,220,220,1)",
      		"pointStrokeColor": "#fff",
      		"pointHighlightFill": "#fff",
      		"pointHighlightStroke": "rgba(151,187,205,0.8)"
    	}]
  	};

    //resetful更新数据,单击刷新按钮时
    $scope.reflashWendu=function(){
      $scope.isRotate=true;//刷新图标是转的
      //让数据先初始化加载后有个动画效果
      $scope.ocw.data[0]=["20", "20", "20", "20", "20", "20", "20","20", "20", "20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20"];
      $scope.ocw.data[1]=["20", "20", "20", "20", "20", "20", "20","20", "20", "20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20"];
      $scope.ocw.data[2]=["20", "20", "20", "20", "20", "20", "20","20", "20", "20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20","20"];

      $http.get('/resetful/nm820/GetTempHistory').success(function(data){
        console.log(data.Avgs);
        $scope.ocw.labels=data.Days;
        $scope.ocw.data[0]=data.Maxs;
        $scope.ocw.data[1]=data.Avgs;
        $scope.ocw.data[2]=data.Mins;
        console.log($scope.ocw);
        $scope.isRotate=false;//刷新图标是不转的
      });
    }
	}
]);

//日湿度曲线,曲线图，
page12_model.controller('page12_LineCtrl_shiduMonth',[
	'$scope',
	function ($scope){
	  	//图表点击时动作
		$scope.onClick = function (points, evt) {
	    	console.log(points, evt);
		};
		$scope.data = [
			[65, 59, 80, 81, 56, 55, 40,65, 59, 80, 81, 56, 55, 40,65, 59, 80, 81, 56, 55, 40,22,23,24],
			[22, 22, 22, 22, 22, 22, 22,22, 22, 22, 22, 22, 22, 22,22, 22, 22, 22, 22, 22, 22,22,22,22],
	  	];
	  	$scope.series=["平均湿度","室外湿度"];
	  	$scope.labels=["0时", "1时", "2时", "3时", "4时", "5时", "6时","7时", "8时", "9时", "10时", "11时", "12时", "13时","14时", "15时", "16时", "17时", "18时", "19时", "20时","21时","22时","23时"];
	}
]);


