
var page12_model=angular.module('MyApp.page12', []);

//24小时温度曲线的控制器，
page12_model.controller('page12_LineCtrl_wenduDay',[
	'$scope',
	function ($scope){
		/*如果不用json图表的另一种表达数据的方式
		$scope.data = [
			[65, 59, 80, 81, 56, 55, 40,65, 59, 80, 81, 56, 55, 40,65, 59, 80, 81, 56, 55, 40,22,23,24],
	    	[22, 59, 80, 33, 56, 55, 40,22, 59, 80, 81, 55, 55, 40,66, 59, 80, 81, 33, 55, 40,22,23,24],
	  	];
	  	*/
	  	//图表点击时动作
		$scope.onClick = function (points, evt) {
	    	console.log(points, evt);
		};


        var lineJson = {
        	"series": ["室内温度","室外温度"],
        	//也可以用上面的scope.data的形式
        	"data": [["18", "19", "20", "21", "21", "22", "21.4","22.4", "24.5", "22.7","23.8","25.7","22.4","26.7","22.9","24.5","19.5","26","21","23","22","22","30","15"],
        			["22.4","26.7","22.9","24.5","19.5","26","21","23","22","22","30","15","18", "19", "20", "21", "21", "22", "21.4","22.4", "24.5", "22.7","23.8","25.7"]],
        	"labels":["0时", "1时", "2时", "3时", "4时", "5时", "6时","7时", "8时", "9时", "10时", "11时", "12时", "13时","14时", "15时", "16时", "17时", "18时", "19时", "20时","21时","22时","23时"],
        	//"colours": [{ // default,可以在canvas里面通过colours="ocw.colours"-使用
        		//填充颜色，有多个曲线时如果后面的没定义就随机
          		//"fillColor": ["rgba(22, 211, 112, 1)"],
          		//图例颜色如seriesA：黄色
          		//"strokeColor": "rgba(20,100,13,1)",
          		//"pointColor": "rgba(220,220,220,1)",
          		//"pointStrokeColor": "#fff",
          		//"pointHighlightFill": "#fff",
          		//"pointHighlightStroke": "rgba(151,187,205,0.8)"
        	//}]
      	};
  		$scope.ocw = lineJson;
	}
]);

//月平均，最大，最小温度曲线的控制器，
page12_model.controller('page12_LineCtrl_wenduMonth',[
	'$scope',
	function ($scope){
	  	//图表点击时动作
		$scope.onClick = function (points, evt) {
	    	console.log(points, evt);
		};


        var lineJson = {
        	"series": ["最高温度","平均温度","最低温度"],
        	//也可以用上面的scope.data的形式
        	"data": [["23", "22", "22", "24", "23", "33", "34","33", "22", "23","24","26","27","28","23","32","22","26","24","27","23","33","32","22","26","24","27","23","33","32","22"],
        			["20", "20", "20", "20", "22", "22", "25","20", "20", "20","20","21","21","21","24","21","27","24","21","19","21","23","23","24","26","24","26","22","32","31","21"],
        			["19", "18", "20", "18", "16", "15", "20","16", "17", "18","19","20","19","19","16","14","18","17","18","16","15","13","12","16","26","24","25","21","31","30","20"]],
        	"labels":["1", "2", "3", "4", "5", "6","7", "8", "9", "10", "11", "12", "13","14", "15", 
        			 "16", "17", "18", "19", "20","21","22","23","24","25","26","27","28","29","30","31"],
        	"colours": [{ // default
        		//填充颜色，有多个曲线时如果后面的没定义就随机
          		"fillColor": ["rgba(22, 211, 112, 0)","rgba(22, 211, 112, 0)"],
          		//图例颜色如seriesA：黄色
          		"strokeColor": "rgba(20,100,13,1)",
          		"pointColor": "rgba(220,220,220,1)",
          		"pointStrokeColor": "#fff",
          		"pointHighlightFill": "#fff",
          		"pointHighlightStroke": "rgba(151,187,205,0.8)"
        	}]
      	};
  		$scope.ocw = lineJson;
	}
]);

//日湿度曲线,曲线图，
page12_model.controller('page12_LineCtrl_shiduDay',[
	'$scope',
	function ($scope){
	  	//图表点击时动作
		$scope.onClick = function (points, evt) {
	    	console.log(points, evt);
		};
		$scope.data = [
			[65, 59, 80, 81, 56, 55, 40,65, 59, 80, 81, 56, 55, 40,65, 59, 80, 81, 56, 55, 40,22,23,24],
			[22, 22, 22, 22, 22, 22, 22,22, 22, 22, 22, 22, 22, 22,22, 22, 22, 22, 22, 22, 22,22,22,22],
	  	];
	  	$scope.series=["平均湿度","室外湿度"];
	  	$scope.labels=["0时", "1时", "2时", "3时", "4时", "5时", "6时","7时", "8时", "9时", "10时", "11时", "12时", "13时","14时", "15时", "16时", "17时", "18时", "19时", "20时","21时","22时","23时"];
	}
]);